let japjisahib = document.getElementById("japjisahib");
let rehrassahib = document.getElementById("rehrassahib");
let anandsahib = document.getElementById("anandsahib")
let chopaisahib = document.getElementById("chopaisahib")
let path = document.getElementById("path");

// JAPJI SAHIB
japjisahib.addEventListener("click" , function(){
    
    rehrassahib.style.backgroundColor = "white"
    rehrassahib.style.color = "black"
    anandsahib.style.backgroundColor = "white"
    anandsahib.style.color = "black"
    chopaisahib.style.backgroundColor = "white"
    chopaisahib.style.color = "black"
    japjisahib.style.backgroundColor = "black"
    japjisahib.style.padding = "5px"
    japjisahib.style.color = "white"
    path.innerHTML = ` ੴ सत नाम करता पुरख निरभओ निरवैर अकाल मूरत अजूनी सैभं गुर प्रसाद ॥
    ॥ जप ॥
    आद सच जुगाद सच ॥
    है भी सच नानक होसी भी सच ॥१॥
    सोचै सोच न होवई जे सोची लख वार ॥
    चुपै चुप न होवई जे लाए रहा लिव तार ॥
    भुखिआ भुख न उतरी जे बंना पुरीआ भार ॥
    सहस सिआणपा लख होहे त इक न चलै नाल ॥
    किव सचिआरा होईऐ किव कूड़ै तुटै पाल ॥
    हुकम रजाई चलणा नानक लिखिआ नाल ॥१॥
    
    हुकमी होवन आकार हुकम न कहिआ जाई ॥
    हुकमी होवन जीअ हुकम मिलै वडिआई ॥
    हुकमी उतम नीच हुकम लिख दुख सुख पाईअह ॥
    इकना हुकमी बखसीस इक हुकमी सदा भवाईअह ॥
    हुकमै अंदर सभ को बाहर हुकम न कोए ॥
    नानक हुकमै जे बुझै त हओमै कहै न कोए ॥२॥
    
    गावै को ताण होवै किसै ताण ॥
    गावै को दात जाणै नीसाण ॥
    गावै को गुण वडिआईआ चार ॥
    गावै को विद्या विखम वीचार ॥
    गावै को साज करे तन खेह ॥
    गावै को जीअ लै फिर देह ॥
    गावै को जापै दिसै दूर ॥
    गावै को वेखै हादरा हदूर ॥
    कथना कथी न आवै तोट ॥
    कथ कथ कथी कोटी कोट कोट ॥
    देदा दे लैदे थक पाहे ॥
    जुगा जुगंतर खाही खाहे ॥
    हुकमी हुकम चलाए राहो ॥
    नानक विगसै वेपरवाहो ॥३॥
    
    साचा साहिब साच नाए भाखिआ भाओ अपार ॥
    आखह मंगह देहे देहे दात करे दातार ॥
    फेर कि अगै रखीऐ जित दिसै दरबार ॥
    मुहौ कि बोलण बोलीऐ जित सुण धरे प्यार ॥
    अमृत वेला सच नाओ वडिआई वीचार ॥
    करमी आवै कपड़ा नदरी मोख दुआर ॥
    नानक एवै जाणीऐ सभ आपे सचिआर ॥४॥
    
    थापेआ न जाए कीता न होए ॥
    आपे आप निरंजन सोए ॥
    जिन सेविआ तेन पाया मान ॥
    नानक गावीऐ गुणी निधान ॥
    गावीऐ सुणीऐ मन रखीऐ भाओ ॥
    दुख परहर सुख घर लै जाए ॥
    गुरमुख नादं गुरमुख वेदं गुरमुख रहेआ समाई ॥
    गुर ईसर गुर गोरख बरमा गुर पारबती माई ॥
    जे हओ जाणा आखा नाही कहणा कथन न जाई ॥
    गुरा इक देहे बुझाई ॥
    सभना जीआ का इक दाता सो मै विसर न जाई ॥५॥
    
    तीरथ नावा जे तिस भावा विण भाणे कि नाए करी ॥
    जेती सिरठि उपाई वेखा विण करमा कि मिलै लई ॥
    मत विच रतन जवाहर माणेक जे इक गुर की सिख सुणी ॥
    गुरा इक देहे बुझाई ॥
    सभना जीआ का इक दाता सो मै विसर न जाई ॥६॥
    
    जे जुग चारे आरजा होर दसूणी होए ॥
    नवा खंडा विच जाणीऐ नाल चलै सभ कोए ॥
    चंगा नाओ रखाए कै जस कीरत जग लेए ॥
    जे तिस नदर न आवई त वात न पुछै के ॥
    कीटा अंदर कीट कर दोसी दोस धरे ॥
    नानक निरगुण गुण करे गुणवंतेआ गुण दे ॥
    तेहा कोए न सुझई ज तिस गुण कोए करे ॥७॥
    
    सुणिअै सिध पीर सुर नाथ ॥
    सुणिअै धरत धवल आकास ॥
    सुणिअै दीप लोअ पाताल ॥
    सुणिअै पोहे न सकै काल ॥
    नानक भगता सदा विगास ॥
    सुणिअै दूख पाप का नास ॥८॥
    
    सुणिअै ईसर बरमा इंद ॥
    सुणिअै मुख सालाहण मंद ॥
    सुणिअै जोग जुगत तन भेद ॥
    सुणिअै सासत सिम्रित वेद ॥
    नानक भगता सदा विगास ॥
    सुणिअै दूख पाप का नास ॥९॥
    
    सुणिअै सत संतोख ज्ञान ॥
    सुणिअै अठसठ का इसनान ॥
    सुणिअै पड़ पड़ पावहे मान ॥
    सुणिअै लागै सहज ध्यान ॥
    नानक भगता सदा विगास ॥
    सुणिअै दूख पाप का नास ॥१०॥
    
    सुणिअै सरा गुणा के गाह ॥
    सुणिअै सेख पीर पातिसाह ॥
    सुणिअै अंधे पावहे राहो ॥
    सुणिअै हाथ होवै असगाहो ॥
    नानक भगता सदा विगास ॥
    सुणिअै दूख पाप का नास ॥११॥
    
    मंने की गत कही न जाए ॥
    जे को कहै पिछै पछुताए ॥
    कागद कलम न लिखणहार ॥
    मंने का बहे करन वीचार ॥
    ऐसा नाम निरंजन होए ॥
    जे को मंन जाणै मन कोए ॥१२॥
    
    मंनै सुरत होवै मन बुध ॥
    मंनै सगल भवण की सुध ॥
    मंनै मुहे चोटा ना खाए ॥
    मंनै जम कै साथ न जाए ॥
    ऐसा नाम निरंजन होए ॥
    जे को मंन जाणै मन कोए ॥१३॥
    
    मंनै मारग ठाक न पाए ॥
    मंनै पत सिओ परगट जाए ॥
    मंनै मग न चलै पंथ ॥
    मंनै धरम सेती सनबंध ॥
    ऐसा नाम निरंजन होए ॥
    जे को मंन जाणै मन कोए ॥१४॥
    
    मंनै पावहे मोख दुआर ॥
    मंनै परवारै साधार ॥
    मंनै तरै तारे गुर सिख ॥
    मंनै नानक भवहे न भिख ॥
    ऐसा नाम निरंजन होए ॥
    जे को मंन जाणै मन कोए ॥१५॥
    
    पंच परवाण पंच परधान ॥
    पंचे पावहे दरगहे मान ॥
    पंचे सोहहे दर राजान ॥
    पंचा का गुर एक ध्यान ॥
    जे को कहै करै वीचार ॥
    करते कै करणै नाही सुमार ॥
    धौल धरम दया का पूत ॥
    संतोख थाप रखिआ जिन सूत ॥
    जे को बुझै होवै सचिआर ॥
    धवलै उपर केता भार ॥
    धरती होर परै होर होर ॥
    तिस ते भार तलै कवण जोर ॥
    जीअ जात रंगा के नाव ॥
    सभना लिखिआ वुड़ी कलाम ॥
    एहो लेखा लिख जाणै कोए ॥
    लेखा लिखिआ केता होए ॥
    केता ताण सुआलिहो रूप ॥
    केती दात जाणै कौण कूत ॥
    कीता पसाओ एको कवाओ ॥
    तिस ते होए लख दरीआओ ॥
    कुदरत कवण कहा वीचार ॥
    वारिआ न जावा एक वार ॥
    जो तुध भावै साई भली कार ॥
    तू सदा सलामत निरंकार ॥१६॥
    
    असंख जप असंख भाओ ॥
    असंख पूजा असंख तप ताओ ॥
    असंख ग्रंथ मुख वेद पाठ ॥
    असंख जोग मन रहहे उदास ॥
    असंख भगत गुण ज्ञान वीचार ॥
    असंख सती असंख दातार ॥
    असंख सूर मुह भख सार ॥
    असंख मोन लिव लाए तार ॥
    कुदरत कवण कहा वीचार ॥
    वारिआ न जावा एक वार ॥
    जो तुध भावै साई भली कार ॥
    तू सदा सलामत निरंकार ॥१७॥
    
    असंख मूरख अंध घोर ॥
    असंख चोर हरामखोर ॥
    असंख अमर कर जाहे जोर ॥
    असंख गलवढ हत्या कमाहे ॥
    असंख पापी पाप कर जाहे ॥
    असंख कूड़िआर कूड़े फिराहे ॥
    असंख मलेछ मल भख खाहे ॥
    असंख निंदक सिर करह भार ॥
    नानक नीच कहै वीचार ॥
    वारिआ न जावा एक वार ॥
    जो तुध भावै साई भली कार ॥
    तू सदा सलामत निरंकार ॥१८॥
    
    असंख नाव असंख थाव ॥
    अगम अगम असंख लोअ ॥
    असंख कहह सिर भार होए ॥
    अखरी नाम अखरी सालाह ॥
    अखरी ज्ञान गीत गुण गाह ॥
    अखरी लिखण बोलण बाण ॥
    अखरा सिर संजोग वखाण ॥
    जिन एहे लिखे तिस सिर नाहे ॥
    जिव फुरमाए तेव तेव पाहे ॥
    जेता कीता तेता नाओ ॥
    विण नावै नाही को थाओ ॥
    कुदरत कवण कहा वीचार ॥
    वारिआ न जावा एक वार ॥
    जो तुध भावै साई भली कार ॥
    तू सदा सलामत निरंकार ॥१९॥
    
    Jap Ji Sahib in Hindi Pauri पौड़ी 19-27
    भरीअै हथ पैर तन देह ॥
    पाणी धोतै उतरस खेह ॥
    मूत पलीती कपड़ होए ॥
    दे साबूण लईऐ ओहो धोए ॥
    भरीअै मत पापा कै संग ॥
    ओहो धोपै नावै कै रंग ॥
    पुंनी पापी आखण नाहे ॥
    कर कर करणा लिख लै जाहो ॥
    आपे बीज आपे ही खाहो ॥
    नानक हुकमी आवहो जाहो ॥२०॥
    
    तीरथ तप दया दत दान ॥
    जे को पावै तेल का मान ॥
    सुणेआ मंनिआ मन कीता भाओ ॥
    अंतरगत तीरथ मल नाओ ॥
    सभ गुण तेरे मै नाही कोए ॥
    विण गुण कीते भगत न होए ॥
    सुअसत आथ बाणी बरमाओ ॥
    सत सुहाण सदा मन चाओ ॥
    कवण सु वेला वखत कवण कवण थित कवण वार ॥
    कवण सि रुती माहो कवण जित होआ आकार ॥
    वेल न पाईआ पंडती जे होवै लेख पुराण ॥
    वखत न पाइओ कादीआ जे लिखन लेख कुराण ॥
    थित वार ना जोगी जाणै रुत माहो ना कोई ॥
    जा करता सिरठी कओ साजे आपे जाणै सोई ॥
    किव कर आखा किव सालाही किओ वरनी किव जाणा ॥
    नानक आखण सभ को आखै इक दू इक सिआणा ॥
    वडा साहिब वडी नाई कीता जा का होवै ॥
    नानक जे को आपौ जाणै अगै गया न सोहै ॥२१॥
    
    पाताला पाताल लख आगासा आगास ॥
    ओड़क ओड़क भाल थके वेद कहन इक वात ॥
    सहस अठारह कहन कतेबा असुलू इक धात ॥
    लेखा होए त लिखीऐ लेखै होए विणास ॥
    नानक वडा आखीऐ आपे जाणै आप ॥२२॥
    
    सालाही सालाहे एती सुरत न पाईआ ॥
    नदीआ अतै वाह पवह समुंद न जाणीअहे ॥
    समुंद साह सुलतान गिरहा सेती माल धन ॥
    कीड़ी तुल न होवनी जे तिस मनहो न वीसरहे ॥२३॥
    
    अंत न सिफती कहण न अंत ॥
    अंत न करणै देण न अंत ॥
    अंत न वेखण सुणण न अंत ॥
    अंत न जापै किआ मन मंत ॥
    अंत न जापै कीता आकार ॥
    अंत न जापै पारावार ॥
    अंत कारण केते बिललाहे ॥
    ता के अंत न पाए जाहे ॥
    एहो अंत न जाणै कोए ॥
    बहुता कहीऐ बहुता होए ॥
    वडा साहिब ऊचा थाओ ॥
    ऊचे उपर ऊचा नाओ ॥
    एवड ऊचा होवै कोए ॥
    तिस ऊचे कओ जाणै सोए ॥
    जेवड आप जाणै आप आप ॥
    नानक नदरी करमी दात ॥२४॥
    
    बहुता करम लिखिआ ना जाए ॥
    वडा दाता तेल न तमाए ॥
    केते मंगहे जोध अपार ॥
    केतेआ गणत नही वीचार ॥
    केते खप तुटहे वेकार ॥
    केते लै लै मुकर पाहे ॥
    केते मूरख खाही खाहे ॥
    केतेआ दूख भूख सद मार ॥
    एहे भि दात तेरी दातार ॥
    बंद खलासी भाणै होए ॥
    होर आख न सकै कोए ॥
    जे को खाएक आखण पाए ॥
    ओहो जाणै जेतीआ मुहे खाए ॥
    आपे जाणै आपे देए ॥
    आखह सि भि केई केए ॥
    जिस नो बखसे सिफत सालाह ॥
    नानक पातसाही पातसाहो ॥२५॥
    
    अमुल गुण अमुल वापार ॥
    अमुल वापारीए अमुल भंडार ॥
    अमुल आवह अमुल लै जाहे ॥
    अमुल भाए अमुला समाहे ॥
    अमुल धरम अमुल दीबाण ॥
    अमुल तुल अमुल परवाण ॥
    अमुल बखसीस अमुल नीसाण ॥
    अमुल करम अमुल फुरमाण ॥
    अमुलो अमुल आखिआ न जाए ॥
    आख आख रहे लिव लाए ॥
    आखहे वेद पाठ पुराण ॥
    आखहे पड़े करह वखिआण ॥
    आखहे बरमे आखहे इंद ॥
    आखहे गोपी तै गोविंद ॥
    आखहे ईसर आखहे सिध ॥
    आखहे केते कीते बुध ॥
    आखहे दानव आखहे देव ॥
    आखहे सुर नर मुन जन सेव ॥
    केते आखहे आखण पाहे ॥
    केते कह कह उठ उठ जाहे ॥
    एते कीते होर करेहे ॥
    ता आख न सकह केई केए ॥
    जेवड भावै तेवड होए ॥
    नानक जाणै साचा सोए ॥
    जे को आखै बोलुविगाड़ ॥
    ता लिखीऐ सिर गावारा गावार ॥२६॥
    
    सो दर केहा सो घर केहा जित बह सरब समाले ॥
    वाजे नाद अनेक असंखा केते वावणहारे ॥
    केते राग परी सिओ कहीअन केते गावणहारे ॥
    गावह तुहनो पौण पाणी बैसंतर गावै राजा धरम दुआरे ॥
    गावह चित गुपत लिख जाणह लिख लिख धरम वीचारे ॥
    गावह ईसर बरमा देवी सोहन सदा सवारे ॥
    गावह इंद इदासण बैठे देवतेआ दर नाले ॥
    गावह सिध समाधी अंदर गावन साध विचारे ॥
    गावन जती सती संतोखी गावह वीर करारे ॥
    गावन पंडित पड़न रखीसर जुग जुग वेदा नाले ॥
    गावहे मोहणीआ मन मोहन सुरगा मछ पयाले ॥
    गावन रतन उपाए तेरे अठसठ तीरथ नाले ॥
    गावहे जोध महाबल सूरा गावह खाणी चारे ॥
    गावहे खंड मंडल वरभंडा कर कर रखे धारे ॥
    सेई तुधनो गावह जो तु भावन रते तेरे भगत रसाले ॥
    होर केते गावन से मै चित न आवन नानक क्या वीचारे ॥
    सोई सोई सदा सच साहिब साचा साची नाई ॥
    है भी होसी जाए न जासी रचना जिन रचाई ॥
    रंगी रंगी भाती कर कर जिनसी माया जिन उपाई ॥
    कर कर वेखै कीता आपणा जिव तिस दी वडिआई ॥
    जो तिस भावै सोई करसी हुकम न करणा जाई ॥
    सो पातसाहो साहा पातसाहिब नानक रहण रजाई ॥२७॥
    
    Jap Ji Sahib in Hindi Pauri 27-38
    मुंदा संतोख सरम पत झोली ध्यान की करह बिभूत ॥
    खिंथा काल कुआरी काया जुगत डंडा परतीत ॥
    आई पंथी सगल जमाती मन जीतै जग जीत ॥
    आदेस तिसै आदेस ॥
    आद अनील अनाद अनाहत जुग जुग एको वेस ॥२८॥
    
    भुगत ज्ञान दया भंडारण घट घट वाजह नाद ॥
    आप नाथ नाथी सभ जा की रिध सिध अवरा साद ॥
    संजोग विजोग दुए कार चलावहे लेखे आवहे भाग ॥
    आदेस तिसै आदेस ॥
    आद अनील अनाद अनाहत जुग जुग एको वेस ॥२९॥
    
    एका माई जुगत विआई तेन चेले परवाण ॥
    इक संसारी इक भंडारी इक लाए दीबाण ॥
    जिव तिस भावै तिवै चलावै जिव होवै फुरमाण ॥
    ओहो वेखै ओना नदर न आवै बहुता एहो विडाण ॥
    आदेस तिसै आदेस ॥
    आद अनील अनाद अनाहत जुग जुग एको वेस ॥३०॥
    
    आसण लोए लोए भंडार ॥
    जो किछ पाया सु एका वार ॥
    कर कर वेखै सिरजणहार ॥
    नानक सचे की साची कार ॥
    आदेस तिसै आदेस ॥
    आद अनील अनाद अनाहत जुग जुग एको वेस ॥३१॥
    
    इक दू जीभौ लख होहे लख होवह लख वीस ॥
    लख लख गेड़ा आखीअह एक नाम जगदीस ॥
    एत राहे पत पवड़ीआ चड़ीऐ होए इकीस ॥
    सुण गला आकास की कीटा आई रीस ॥
    नानक नदरी पाईऐ कूड़ी कूड़ै ठीस ॥३२॥
    
    आखण जोर चुपै नह जोर ॥
    जोर न मंगण देण न जोर ॥
    जोर न जीवण मरण नह जोर ॥
    जोर न राज माल मन सोर ॥
    जोर न सुरती ज्ञान वीचार ॥
    जोर न जुगती छुटै संसार ॥
    जिस हथ जोर कर वेखै सोए ॥
    नानक उतम नीच न कोए ॥३३॥
    
    राती रुती थिती वार ॥
    पवण पाणी अगनी पाताल ॥
    तिस विच धरती थाप रखी धरम साल ॥
    तिस विच जीअ जुगत के रंग ॥
    तिन के नाम अनेक अनंत ॥
    करमी करमी होए वीचार ॥
    सचा आप सचा दरबार ॥
    तिथै सोहन पंच परवाण ॥
    नदरी करम पवै नीसाण ॥
    कच पकाई ओथै पाए ॥
    नानक गया जापै जाए ॥३४॥
    
    धरम खंड का एहो धरम ॥
    ज्ञान खंड का आखहो करम ॥
    केते पवण पाणी वैसंतर केते कान्ह महेस ॥
    केते बरमे घाड़त घड़ीअह रूप रंग के वेस ॥
    केतीआ करम भूमी मेर केते केते धू उपदेस ॥
    केते इंद चंद सूर केते केते मंडल देस ॥
    केते सिध बुध नाथ केते केते देवी वेस ॥
    केते देव दानव मुन केते केते रतन समुंद ॥
    केतीआ खाणी केतीआ बाणी केते पात नरिंद ॥
    केतीआ सुरती सेवक केते नानक अंत न अंत ॥३५॥
    
    ज्ञान खंड मह ज्ञान परचंड ॥
    तिथै नाद बिनोद कोड अनंद ॥
    सरम खंड की बाणी रूप ॥
    तिथै घाड़त घड़ीऐ बहुत अनूप ॥
    ता कीआ गला कथीआ ना जाहे ॥
    जे को कहै पिछै पछुताए ॥
    तिथै घड़ीअै सुरत मत मन बुध ॥
    तिथै घड़ीअै सुरा सिधा की सुध ॥३६॥
    
    करम खंड की बाणी जोर ॥
    तिथै होर न कोई होर ॥
    तिथै जोध महाबल सूर ॥
    तिन मह राम रहिआ भरपूर ॥
    तिथै सीतो सीता महिमा माहे ॥
    ता के रूप न कथने जाहे ॥
    ना ओह मरह न ठागे जाहे ॥
    जिन कै राम वसै मन माहे ॥
    तिथै भगत वसह के लोअ ॥
    करह अनंद सचा मन सोए ॥
    सच खंड वसै निरंकार ॥
    कर कर वेखै नदर निहाल ॥
    तिथै खंड मंडल वरभंड ॥
    जे को कथै त अंत न अंत ॥
    तिथै लोअ लोअ आकार ॥
    जिव जिव हुकम तिवै तिव कार ॥
    वेखै विगसै कर वीचार ॥
    नानक कथना करड़ा सार ॥३७॥
    
    जत पाहारा धीरज सुनिआर ॥
    अहरण मत वेद हथीआर ॥
    भओ खला अगन तप ताओ ॥
    भांडा भाओ अमृत तित ढाल ॥
    घड़ीअै सबद सची टकसाल ॥
    जिन कओ नदर करम तिन कार ॥
    नानक नदरी नदर निहाल ॥३८॥
    <br> <br>
    सलोक ॥
    पवण गुरू पाणी पिता माता धरत महत ॥
    दिवस रात दुए दाई दाया खेलै सगल जगत ॥
    चंगिआईआ बुरिआईआ वाचै धरम हदूर ॥
    करमी आपो आपणी के नेड़ै के दूर ॥
    जिनी नाम धिआया गए मसकत घाल ॥
    नानक ते मुख उजले केती छुटी नाल ॥१॥ `
})
// REHRAS SAHIB
rehrassahib.addEventListener("click" , function(){
    anandsahib.style.backgroundColor = "white"
    anandsahib.style.color = "black"
    chopaisahib.style.backgroundColor = "white"
    chopaisahib.style.color = "black"
    japjisahib.style.backgroundColor = "white"
    japjisahib.style.color = "black"
    rehrassahib.style.backgroundColor = "black"
   rehrassahib.style.padding = "5px"
   rehrassahib.style.color = "white"
   path.innerHTML = `हरि जुगु जुगु भगत उपाइआ पैज रखदा आइआ राम राजे ॥
   हरणाखसु दुसटु हरि मारिआ प्रहलादु तराइआ ॥
   अहंकारीआ निंदका पिठि देइ नामदेउ मुखि लाइआ ॥
   जन नानक ऐसा हरि सेविआ अंति लए छडाइआ ॥४॥१३॥२०॥
   
   सलोकु मः १ ॥
   दुखु दारू सुखु रोगु भइआ जा सुखु तामि न होई ॥
   तूं करता करणा मै नाही जा हउ करी न होई ॥१॥
   
   बलिहारी कुदरति वसिआ ॥
   तेरा अंतु न जाई लखिआ ॥१॥
   रहाउ ॥
   
   जाति महि जोति जोति महि जाता अकल कला भरपूरि रहिआ ॥
   तूं सचा साहिबु सिफति सुआल्हिउ जिनि कीती सो पारि पइआ ॥
   कहु नानक करते कीआ बाता जो किछु करणा सु करि रहिआ ॥२॥
   
   सो दरु रागु आसा महला १
   ੴ सतिगुर प्रसादि ॥
   सो दरु तेरा केहा सो घरु केहा जितु बहि सरब समाले ॥
   वाजे तेरे नाद अनेक असंखा केते तेरे वावणहारे ॥
   केते तेरे राग परी सिउ कहीअहि केते तेरे गावणहारे ॥
   
   गावनि तुधनो पवणु पाणी बैसंतरु गावै राजा धरमु दुआरे ॥
   गावनि तुधनो चितु गुपतु लिखि जाणनि लिखि लिखि धरमु बीचारे ॥
   गावनि तुधनो ईसरु ब्रहमा देवी सोहनि तेरे सदा सवारे ॥
   गावनि तुधनो इंद्र इंद्रासणि बैठे देवतिआ दरि नाले ॥
   गावनि तुधनो सिध समाधी अंदरि गावनि तुधनो साध बीचारे ॥
   
   गावनि तुधनो जती सती संतोखी गावनि तुधनो वीर करारे ॥
   गावनि तुधनो पंडित पड़नि रखीसुर जुगु जुगु वेदा नाले ॥
   गावनि तुधनो मोहणीआ मनु मोहनि सुरगु मछु पइआले ॥
   गावनि तुधनो रतन उपाए तेरे अठसठि तीरथ नाले ॥
   गावनि तुधनो जोध महाबल सूरा गावनि तुधनो खाणी चारे ॥
   गावनि तुधनो खंड मंडल ब्रहमंडा करि करि रखे तेरे धारे ॥
   
   सेई तुधनो गावनि जो तुधु भावनि रते तेरे भगत रसाले ॥
   होरि केते तुधनो गावनि से मै चिति न आवनि नानकु किआ बीचारे ॥
   सोई सोई सदा सचु साहिबु साचा साची नाई ॥
   है भी होसी जाइ न जासी रचना जिनि रचाई ॥
   रंगी रंगी भाती करि करि जिनसी माइआ जिनि उपाई ॥
   करि करि देखै कीता आपणा जिउ तिस दी वडिआई ॥
   जो तिसु भावै सोई करसी फिरि हुकमु न करणा जाई ॥
   सो पातिसाहु साहा पतिसाहिबु नानक रहणु रजाई ॥१॥
   
   आसा महला १ ॥
   
   सुणि वडा आखै सभु कोइ ॥
   केवडु वडा डीठा होइ ॥
   कीमति पाइ न कहिआ जाइ ॥
   कहणै वाले तेरे रहे समाइ ॥१॥
   
   वडे मेरे साहिबा गहिर ग्मभीरा गुणी गहीरा ॥
   कोइ न जाणै तेरा केता केवडु चीरा ॥१॥
   रहाउ ॥
   
   सभि सुरती मिलि सुरति कमाई ॥
   सभ कीमति मिलि कीमति पाई ॥
   गिआनी धिआनी गुर गुरहाई ॥
   कहणु न जाई तेरी तिलु वडिआई ॥२॥
   
   सभि सत सभि तप सभि चंगिआईआ ॥
   सिधा पुरखा कीआ वडिआईआ ॥
   तुधु विणु सिधी किनै न पाईआ ॥
   करमि मिलै नाही ठाकि रहाईआ ॥३॥
   
   आखण वाला किआ वेचारा ॥
   सिफती भरे तेरे भंडारा ॥
   जिसु तू देहि तिसै किआ चारा ॥
   नानक सचु सवारणहारा ॥४॥२॥
   
   आसा महला १ ॥
   आखा जीवा विसरै मरि जाउ ॥
   आखणि अउखा साचा नाउ ॥
   साचे नाम की लागै भूख ॥
   उतु भूखै खाइ चलीअहि दूख ॥१॥
   
   सो किउ विसरै मेरी माइ ॥
   साचा साहिबु साचै नाइ ॥१॥
   
   रहाउ ॥
   
   साचे नाम की तिलु वडिआई ॥
   आखि थके कीमति नही पाई ॥
   जे सभि मिलि कै आखण पाहि ॥
   वडा न होवै घाटि न जाइ ॥२॥
   
   ना ओहु मरै न होवै सोगु ॥
   देदा रहै न चूकै भोगु ॥
   गुणु एहो होरु नाही कोइ ॥
   ना को होआ ना को होइ ॥३॥
   
   जेवडु आपि तेवड तेरी दाति ॥
   जिनि दिनु करि कै कीती राति ॥
   खसमु विसारहि ते कमजाति ॥
   नानक नावै बाझु सनाति ॥४॥३॥
   
   रागु गूजरी महला ४ ॥
   हरि के जन सतिगुर सतपुरखा बिनउ करउ गुर पासि ॥
   हम कीरे किरम सतिगुर सरणाई करि दइआ नामु परगासि ॥१॥
   
   मेरे मीत गुरदेव मो कउ राम नामु परगासि ॥
   गुरमति नामु मेरा प्रान सखाई हरि कीरति हमरी रहरासि ॥१॥ रहाउ ॥
   
   हरि जन के वड भाग वडेरे जिन हरि हरि सरधा हरि पिआस ॥
   हरि हरि नामु मिलै त्रिपतासहि मिलि संगति गुण परगासि ॥२॥
   
   जिन हरि हरि हरि रसु नामु न पाइआ ते भागहीण जम पासि ॥
   जो सतिगुर सरणि संगति नही आए ध्रिगु जीवे ध्रिगु जीवासि ॥३॥
   
   जिन हरि जन सतिगुर संगति पाई तिन धुरि मसतकि लिखिआ लिखासि ॥
   धनु धंनु सतसंगति जितु हरि रसु पाइआ मिलि जन नानक नामु परगासि ॥४॥४॥
   
   रागु गूजरी महला ५ ॥
   काहे रे मन चितवहि उदमु जा आहरि हरि जीउ परिआ ॥
   सैल पथर महि जंत उपाए ता का रिजकु आगै करि धरिआ ॥१॥
   
   मेरे माधउ जी सतसंगति मिले सु तरिआ ॥
   गुर परसादि परम पदु पाइआ सूके कासट हरिआ ॥१॥ रहाउ ॥
   
   जननि पिता लोक सुत बनिता कोइ न किस की धरिआ ॥
   सिरि सिरि रिजकु स्मबाहे ठाकुरु काहे मन भउ करिआ ॥२॥
   
   ऊडे ऊडि आवै सै कोसा तिसु पाछै बचरे छरिआ ॥
   तिन कवणु खलावै कवणु चुगावै मन महि सिमरनु करिआ ॥३॥
   
   सभि निधान दस असट सिधान ठाकुर कर तल धरिआ ॥
   जन नानक बलि बलि सद बलि जाईऐ तेरा अंतु न पारावरिआ ॥४॥५॥
   
   रागु आसा महला ४ सो पुरखु
   ੴ सतिगुर प्रसादि ॥
   सो पुरखु निरंजनु हरि पुरखु निरंजनु हरि अगमा अगम अपारा ॥
   सभि धिआवहि सभि धिआवहि तुधु जी हरि सचे सिरजणहारा ॥
   सभि जीअ तुमारे जी तूं जीआ का दातारा ॥
   हरि धिआवहु संतहु जी सभि दूख विसारणहारा ॥
   हरि आपे ठाकुरु हरि आपे सेवकु जी किआ नानक जंत विचारा ॥१॥
   
   तूं घट घट अंतरि सरब निरंतरि जी हरि एको पुरखु समाणा ॥
   इकि दाते इकि भेखारी जी सभि तेरे चोज विडाणा ॥
   तूं आपे दाता आपे भुगता जी हउ तुधु बिनु अवरु न जाणा ॥
   तूं पारब्रहमु बेअंतु बेअंतु जी तेरे किआ गुण आखि वखाणा ॥
   जो सेवहि जो सेवहि तुधु जी जनु नानकु तिन कुरबाणा ॥२॥
   
   हरि धिआवहि हरि धिआवहि तुधु जी से जन जुग महि सुखवासी ॥
   से मुकतु से मुकतु भए जिन हरि धिआइआ जी तिन तूटी जम की फासी ॥
   जिन निरभउ जिन हरि निरभउ धिआइआ जी तिन का भउ सभु गवासी ॥
   जिन सेविआ जिन सेविआ मेरा हरि जी ते हरि हरि रूपि समासी ॥
   से धंनु से धंनु जिन हरि धिआइआ जी जनु नानकु तिन बलि जासी ॥३॥
   
   तेरी भगति तेरी भगति भंडार जी भरे बिअंत बेअंता ॥
   तेरे भगत तेरे भगत सलाहनि तुधु जी हरि अनिक अनेक अनंता ॥
   तेरी अनिक तेरी अनिक करहि हरि पूजा जी तपु तापहि जपहि बेअंता ॥
   तेरे अनेक तेरे अनेक पड़हि बहु सिम्रिति सासत जी करि किरिआ खटु करम करंता ॥
   से भगत से भगत भले जन नानक जी जो भावहि मेरे हरि भगवंता ॥४॥
   
   तूं आदि पुरखु अपर्मपरु करता जी तुधु जेवडु अवरु न कोई ॥
   तूं जुगु जुगु एको सदा सदा तूं एको जी तूं निहचलु करता सोई ॥
   तुधु आपे भावै सोई वरतै जी तूं आपे करहि सु होई ॥
   तुधु आपे स्रिसटि सभ उपाई जी तुधु आपे सिरजि सभ गोई ॥
   जनु नानकु गुण गावै करते के जी जो सभसै का जाणोई ॥५॥१॥
   
   आसा महला ४ ॥
   तूं करता सचिआरु मैडा सांई ॥
   जो तउ भावै सोई थीसी जो तूं देहि सोई हउ पाई ॥१॥ रहाउ ॥
   
   सभ तेरी तूं सभनी धिआइआ ॥
   जिस नो क्रिपा करहि तिनि नाम रतनु पाइआ ॥
   गुरमुखि लाधा मनमुखि गवाइआ ॥
   तुधु आपि विछोड़िआ आपि मिलाइआ ॥१॥
   
   तूं दरीआउ सभ तुझ ही माहि ॥
   तुझ बिनु दूजा कोई नाहि ॥
   जीअ जंत सभि तेरा खेलु ॥
   विजोगि मिलि विछुड़िआ संजोगी मेलु ॥२॥
   जिस नो तू जाणाइहि सोई जनु जाणै ॥
   हरि गुण सद ही आखि वखाणै ॥
   जिनि हरि सेविआ तिनि सुखु पाइआ ॥
   सहजे ही हरि नामि समाइआ ॥३॥
   
   तू आपे करता तेरा कीआ सभु होइ ॥
   तुधु बिनु दूजा अवरु न कोइ ॥
   तू करि करि वेखहि जाणहि सोइ ॥
   जन नानक गुरमुखि परगटु होइ ॥४॥२॥
   
   आसा महला १ ॥
   तितु सरवरड़ै भईले निवासा पाणी पावकु तिनहि कीआ ॥
   पंकजु मोह पगु नही चालै हम देखा तह डूबीअले ॥१॥
   
   मन एकु न चेतसि मूड़ मना ॥
   हरि बिसरत तेरे गुण गलिआ ॥१॥ रहाउ ॥
   ना हउ जती सती नही पड़िआ मूरख मुगधा जनमु भइआ ॥
   प्रणवति नानक तिन की सरणा जिन तू नाही वीसरिआ ॥२॥३॥
   
   आसा महला ५ ॥
   भई परापति मानुख देहुरीआ ॥
   गोबिंद मिलण की इह तेरी बरीआ ॥
   अवरि काज तेरै कितै न काम ॥
   मिलु साधसंगति भजु केवल नाम ॥१॥
   
   सरंजामि लागु भवजल तरन कै ॥
   जनमु ब्रिथा जात रंगि माइआ कै ॥१॥ रहाउ ॥
   जपु तपु संजमु धरमु न कमाइआ ॥
   सेवा साध न जानिआ हरि राइआ ॥
   कहु नानक हम नीच करमा ॥
   सरणि परे की राखहु सरमा ॥२॥४॥
   
   कबयो बाच बेनती ॥
   चौपई ॥
   हमरी करो हाथ दै ्रछा ॥
   पूरन होइ चि्त की इछा ॥
   तव चरनन मन रहै हमारा ॥
   अपना जान करो प्रतिपारा ॥३७७॥
   
   हमरे दुशट सभै तुम घावहु ॥
   आपु हाथ दै मोहि बचावहु ॥
   सुखी बसै मोरो परिवारा ॥
   सेवक सि्खय सभै करतारा ॥३७८॥
   
   मो ्रछा निजु कर दै करियै ॥
   सभ बैरिन कौ आज संघरियै ॥
   पूरन होइ हमारी आसा ॥
   तोरि भजन की रहै पियासा ॥३७९॥
   
   तुमहि छाडि कोई अवर न धयाऊं ॥
   जो बर चहों सु तुमते पाऊं ॥
   सेवक सि्खय हमारे तारियहि ॥
   चुन चुन श्त्रु हमारे मारियहि ॥३८०॥
   
   आपु हाथ दै मुझै उबरियै ॥
   मरन काल त्रास निवरियै ॥
   हूजो सदा हमारे प्छा ॥
   स्री असिधुज जू करियहु ्रछा ॥३८१॥
   
   राखि लेहु मुहि राखनहारे ॥
   साहिब संत सहाइ पियारे ॥
   दीनबंधु दुशटन के हंता ॥
   तुमहो पुरी चतुरदस कंता ॥३८२॥
   
   काल पाइ ब्रहमा बपु धरा ॥
   काल पाइ शिवजू अवतरा ॥
   काल पाइ करि बिशन प्रकाशा ॥
   सकल काल का कीया तमाशा ॥३८३॥
   
   जवन काल जोगी शिव कीयो ॥
   बेद राज ब्रहमा जू थीयो ॥
   जवन काल सभ लोक सवारा ॥
   नमशकार है ताहि हमारा ॥३८४॥
   
   जवन काल सभ जगत बनायो ॥
   देव दैत ज्छन उपजायो ॥
   आदि अंति एकै अवतारा ॥
   सोई गुरू समझियहु हमारा ॥३८५॥
   
   नमशकार तिस ही को हमारी ॥
   सकल प्रजा जिन आप सवारी ॥
   सिवकन को सवगुन सुख दीयो ॥
   श्त्रुन को पल मो बध कीयो ॥३८६॥
   
   घट घट के अंतर की जानत ॥
   भले बुरे की पीर पछानत ॥
   चीटी ते कुंचर असथूला ॥
   सभ पर क्रिपा द्रिशटि करि फूला ॥३८७॥
   
   संतन दुख पाए ते दुखी ॥
   सुख पाए साधन के सुखी ॥
   एक एक की पीर पछानै ॥
   घट घट के पट पट की जानै ॥३८८॥
   
   जब उदकरख करा करतारा ॥
   प्रजा धरत तब देह अपारा ॥
   जब आकरख करत हो कबहूं ॥
   तुम मै मिलत देह धर सभहूं ॥३८९॥
   
   जेते बदन स्रिशटि सभ धारै ॥
   आपु आपुनी बूझि उचारै ॥
   तुम सभ ही ते रहत निरालम ॥
   जानत बेद भेद अरु आलम ॥३९०॥
   
   निरंकार न्रिबिकार न्रिल्मभ ॥
   आदि अनील अनादि अस्मभ ॥
   ताका मूड़्ह उचारत भेदा ॥
   जाको भेव न पावत बेदा ॥३९१॥
   
   ताकौ करि पाहन अनुमानत ॥
   महां मूड़्ह कछु भेद न जानत ॥
   महांदेव कौ कहत सदा शिव ॥
   निरंकार का चीनत नहि भिव ॥३९२॥
   
   आपु आपुनी बुधि है जेती ॥
   बरनत भिंन भिंन तुहि तेती ॥
   तुमरा लखा न जाइ पसारा ॥
   किह बिधि सजा प्रथम संसारा ॥३९३॥
   
   एकै रूप अनूप सरूपा ॥
   रंक भयो राव कहीं भूपा ॥
   अंडज जेरज सेतज कीनी ॥
   उतभुज खानि बहुरि रचि दीनी ॥३९४॥
   
   कहूं फूलि राजा ह्वै बैठा ॥
   कहूं सिमटि भयो शंकर इकैठा ॥
   सगरी स्रिशटि दिखाइ अच्मभव ॥
   आदि जुगादि सरूप सुय्मभव ॥३९५॥
   
   अब ्रछा मेरी तुम करो ॥
   सि्खय उबारि असि्खय स्घरो ॥
   दुशट जिते उठवत उतपाता ॥
   सकल मलेछ करो रण घाता ॥३९६॥
   
   जे असिधुज तव शरनी परे ॥
   तिन के दुशट दुखित ह्वै मरे ॥
   पुरख जवन पगु परे तिहारे ॥
   तिन के तुम संकट सभ टारे ॥३९७॥
   
   जो कलि कौ इक बार धिऐहै ॥
   ता के काल निकटि नहि ऐहै ॥
   ्रछा होइ ताहि सभ काला ॥
   दुशट अरिशट टरे ततकाला ॥३९८॥
   
   क्रिपा द्रिशाटि तन जाहि निहरिहो ॥
   ताके ताप तनक महि हरिहो ॥
   रि्धि सि्धि घर मों सभ होई ॥
   दुशट छाह छ्वै सकै न कोई ॥३९९॥
   
   एक बार जिन तुमैं स्मभारा ॥
   काल फास ते ताहि उबारा ॥
   जिन नर नाम तिहारो कहा ॥
   दारिद दुशट दोख ते रहा ॥४००॥
   
   खड़ग केत मैं शरनि तिहारी ॥
   आप हाथ दै लेहु उबारी ॥
   सरब ठौर मो होहु सहाई ॥
   दुशट दोख ते लेहु बचाई ॥४०१॥
   
   क्रिपा करी हम पर जगमाता ॥
   ग्रंथ करा पूरन सुभ राता ॥
   किलबिख सकल देह को हरता ॥
   दुशट दोखियन को छै करता ॥४०२॥
   
   स्री असिधुज जब भए दयाला ॥
   पूरन करा ग्रंथ ततकाला ॥
   मन बांछत फल पावै सोई ॥
   दूख न तिसै बिआपत कोई ॥४०३॥
   
   अड़ि्ल ॥
   सुनै गुंग जो याहि सु रसना पावई ॥
   सुनै मूड़्ह चित लाइ चतुरता आवई ॥
   दूख दरद भौ निकट न तिन नर के रहै ॥
   हो जो याकी एक बार चौपई को कहै ॥४०४॥
   
   चौपई ॥
   स्मबत स्त्रह सहस भणि्जै ॥
   अरध सहस फुनि तीनि कहि्जै ॥
   भाद्रव सुदी अशटमी रवि वारा ॥
   तीर सतु्द्रव ग्रंथ सुधारा ॥४०५॥
   
   इति स्री चरित्र पख्याने त्रिया चरित्रे मंत्री भूप स्मबादे चार सौ चार चरित्र समापतम सतु सुभम सतु ॥४०३॥७१३४॥ अफजूं ॥
   पांइ गहे जब ते तुमरे तब ते कोऊ आंख तरे नही आनियो ॥
   राम रहीम पुरान कुरान अनेक कहैं मति एक न मानियो ॥
   सिम्रिति सासत्र बेद सभै बहु भेद कहै हम एक न जानियो ॥
   स्री असिपानि क्रिपा तुमरी करि मै न कहियो सभ तोहि बखानियो ॥८६३॥
   
   दोहरा ॥
   सगल दुआर को छाडि कै गहियो तुहारो दुआर ॥
   बांहि गहे की लाज असि गोबिंद दास तुहार ॥८६४॥
   
   रामकली महला ३ अनंदु
   ੴ सतिगुर प्रसादि ॥
   अनंदु भइआ मेरी माए सतिगुरू मै पाइआ ॥
   सतिगुरु त पाइआ सहज सेती मनि वजीआ वाधाईआ ॥
   राग रतन परवार परीआ सबद गावण आईआ ॥
   सबदो त गावहु हरी केरा मनि जिनी वसाइआ ॥
   कहै नानकु अनंदु होआ सतिगुरू मै पाइआ ॥१॥
   
   ए मन मेरिआ तू सदा रहु हरि नाले ॥
   हरि नालि रहु तू मंन मेरे दूख सभि विसारणा ॥
   अंगीकारु ओहु करे तेरा कारज सभि सवारणा ॥
   सभना गला समरथु सुआमी सो किउ मनहु विसारे ॥
   कहै नानकु मंन मेरे सदा रहु हरि नाले ॥२॥
   
   साचे साहिबा किआ नाही घरि तेरै ॥
   घरि त तेरै सभु किछु है जिसु देहि सु पावए ॥
   सदा सिफति सलाह तेरी नामु मनि वसावए ॥
   नामु जिन कै मनि वसिआ वाजे सबद घनेरे ॥
   कहै नानकु सचे साहिब किआ नाही घरि तेरै ॥३॥
   
   साचा नामु मेरा आधारो ॥
   साचु नामु अधारु मेरा जिनि भुखा सभि गवाईआ ॥
   करि सांति सुख मनि आइ वसिआ जिनि इछा सभि पुजाईआ ॥
   सदा कुरबाणु कीता गुरू विटहु जिस दीआ एहि वडिआईआ ॥
   कहै नानकु सुणहु संतहु सबदि धरहु पिआरो ॥
   साचा नामु मेरा आधारो ॥४॥
   
   वाजे पंच सबद तितु घरि सभागै ॥
   घरि सभागै सबद वाजे कला जितु घरि धारीआ ॥
   पंच दूत तुधु वसि कीते कालु कंटकु मारिआ ॥
   धुरि करमि पाइआ तुधु जिन कउ सि नामि हरि कै लागे ॥
   कहै नानकु तह सुखु होआ तितु घरि अनहद वाजे ॥५॥
   
   अनदु सुणहु वडभागीहो सगल मनोरथ पूरे ॥
   पारब्रहमु प्रभु पाइआ उतरे सगल विसूरे ॥
   दूख रोग संताप उतरे सुणी सची बाणी ॥
   संत साजन भए सरसे पूरे गुर ते जाणी ॥
   सुणते पुनीत कहते पवितु सतिगुरु रहिआ भरपूरे ॥
   बिनवंति नानकु गुर चरण लागे वाजे अनहद तूरे ॥४०॥१॥
   
   मुंदावणी महला ५ ॥
   थाल विचि तिंनि वसतू पईओ सतु संतोखु वीचारो ॥
   अम्रित नामु ठाकुर का पइओ जिस का सभसु अधारो ॥
   जे को खावै जे को भुंचै तिस का होइ उधारो ॥
   एह वसतु तजी नह जाई नित नित रखु उरि धारो ॥
   तम संसारु चरन लगि तरीऐ सभु नानक ब्रहम पसारो ॥१॥
   
   सलोक महला ५ ॥
   तेरा कीता जातो नाही मैनो जोगु कीतोई ॥
   मै निरगुणिआरे को गुणु नाही आपे तरसु पइओई ॥
   तरसु पइआ मिहरामति होई सतिगुरु सजणु मिलिआ ॥
   नानक नामु मिलै तां जीवां तनु मनु थीवै हरिआ ॥१॥
   
   पउड़ी ॥
   तिथै तू समरथु जिथै कोइ नाहि ॥
   ओथै तेरी रख अगनी उदर माहि ॥
   सुणि कै जम के दूत नाइ तेरै छडि जाहि ॥
   भउजलु बिखमु असगाहु गुर सबदी पारि पाहि ॥
   जिन कउ लगी पिआस अम्रितु सेइ खाहि ॥
   कलि महि एहो पुंनु गुण गोविंद गाहि ॥
   सभसै नो किरपालु सम्हाले साहि साहि ॥
   बिरथा कोइ न जाइ जि आवै तुधु आहि ॥९॥
   
   रागु गूजरी वार महला ५
   ੴ सतिगुर प्रसादि ॥
   
   सलोकु मः ५ ॥
   
   अंतरि गुरु आराधणा जिहवा जपि गुर नाउ ॥
   नेत्री सतिगुरु पेखणा स्रवणी सुनणा गुर नाउ ॥
   सतिगुर सेती रतिआ दरगह पाईऐ ठाउ ॥
   कहु नानक किरपा करे जिस नो एह वथु देइ ॥
   जग महि उतम काढीअहि विरले केई केइ ॥१॥
   
   मः ५ ॥
   
   रखे रखणहारि आपि उबारिअनु ॥
   गुर की पैरी पाइ काज सवारिअनु ॥
   होआ आपि दइआलु मनहु न विसारिअनु ॥
   साध जना कै संगि भवजलु तारिअनु ॥
   साकत निंदक दुसट खिन माहि बिदारिअनु ॥
   तिसु साहिब की टेक नानक मनै माहि ॥
   जिसु सिमरत सुखु होइ सगले दूख जाहि ॥२॥ `
})
// ANAND SAHIB
anandsahib.addEventListener("click", function(){
    rehrassahib.style.backgroundColor = "white"
    rehrassahib.style.color = "black"
    chopaisahib.style.backgroundColor = "white"
    chopaisahib.style.color = "black"
    japjisahib.style.backgroundColor = "white"
    japjisahib.style.color = "black"
    anandsahib.style.backgroundColor = "black"
   anandsahib.style.padding = "5px"
   anandsahib.style.color = "white"
   path.innerHTML = `
   रामकली महला ३ अनंदु

ੴ सतिगुर प्रसादि ॥

अनंदु भइआ मेरी माए सतिगुरू मै पाइआ ॥
सतिगुरु त पाइआ सहज सेती मनि वजीआ वाधाईआ ॥
राग रतन परवार परीआ सबद गावण आईआ ॥
सबदो त गावहु हरी केरा मनि जिनी वसाइआ ॥
कहै नानकु अनंदु होआ सतिगुरू मै पाइआ ॥१॥



ए मन मेरिआ तू सदा रहु हरि नाले ॥
हरि नालि रहु तू मंन मेरे दूख सभि विसारणा ॥
अंगीकारु ओहु करे तेरा कारज सभि सवारणा ॥
सभना गला समरथु सुआमी सो किउ मनहु विसारे ॥
कहै नानकु मंन मेरे सदा रहु हरि नाले ॥२॥



साचे साहिबा किआ नाही घरि तेरै ॥
घरि त तेरै सभु किछु है जिसु देहि सु पावए ॥
सदा सिफति सलाह तेरी नामु मनि वसावए ॥
नामु जिन कै मनि वसिआ वाजे सबद घनेरे ॥
कहै नानकु सचे साहिब किआ नाही घरि तेरै ॥३॥



साचा नामु मेरा आधारो ॥
साचु नामु अधारु मेरा जिनि भुखा सभि गवाईआ ॥
करि सांति सुख मनि आइ वसिआ जिनि इछा सभि पुजाईआ ॥
सदा कुरबाणु कीता गुरू विटहु जिस दीआ एहि वडिआईआ ॥
कहै नानकु सुणहु संतहु सबदि धरहु पिआरो ॥
साचा नामु मेरा आधारो ॥४॥



वाजे पंच सबद तितु घरि सभागै ॥
घरि सभागै सबद वाजे कला जितु घरि धारीआ ॥
पंच दूत तुधु वसि कीते कालु कंटकु मारिआ ॥
धुरि करमि पाइआ तुधु जिन कउ सि नामि हरि कै लागे ॥
कहै नानकु तह सुखु होआ तितु घरि अनहद वाजे ॥५॥



साची लिवै बिनु देह निमाणी ॥
देह निमाणी लिवै बाझहु किआ करे वेचारीआ ॥
तुधु बाझु समरथ कोइ नाही क्रिपा करि बनवारीआ ॥
एस नउ होरु थाउ नाही सबदि लागि सवारीआ ॥
कहै नानकु लिवै बाझहु किआ करे वेचारीआ ॥६॥



आनंदु आनंदु सभु को कहै आनंदु गुरू ते जाणिआ ॥
जाणिआ आनंदु सदा गुर ते क्रिपा करे पिआरिआ ॥
करि किरपा किलविख कटे गिआन अंजनु सारिआ ॥
अंदरहु जिन का मोहु तुटा तिन का सबदु सचै सवारिआ ॥
कहै नानकु एहु अनंदु है आनंदु गुर ते जाणिआ ॥७॥



बाबा जिसु तू देहि सोई जनु पावै ॥
पावै त सो जनु देहि जिस नो होरि किआ करहि वेचारिआ ॥
इकि भरमि भूले फिरहि दह दिसि इकि नामि लागि सवारिआ ॥
गुर परसादी मनु भइआ निरमलु जिना भाणा भावए ॥
कहै नानकु जिसु देहि पिआरे सोई जनु पावए ॥८॥



आवहु संत पिआरिहो अकथ की करह कहाणी ॥
करह कहाणी अकथ केरी कितु दुआरै पाईऐ ॥
तनु मनु धनु सभु सउपि गुर कउ हुकमि मंनिऐ पाईऐ ॥
हुकमु मंनिहु गुरू केरा गावहु सची बाणी ॥
कहै नानकु सुणहु संतहु कथिहु अकथ कहाणी ॥९॥



ए मन चंचला चतुराई किनै न पाइआ ॥
चतुराई न पाइआ किनै तू सुणि मंन मेरिआ ॥
एह माइआ मोहणी जिनि एतु भरमि भुलाइआ ॥
माइआ त मोहणी तिनै कीती जिनि ठगउली पाईआ ॥
कुरबाणु कीता तिसै विटहु जिनि मोहु मीठा लाइआ ॥
कहै नानकु मन चंचल चतुराई किनै न पाइआ ॥१०॥



ए मन पिआरिआ तू सदा सचु समाले ॥
एहु कुट्मबु तू जि देखदा चलै नाही तेरै नाले ॥
साथि तेरै चलै नाही तिसु नालि किउ चितु लाईऐ ॥
ऐसा कमु मूले न कीचै जितु अंति पछोताईऐ ॥
सतिगुरू का उपदेसु सुणि तू होवै तेरै नाले ॥
कहै नानकु मन पिआरे तू सदा सचु समाले ॥११॥



अगम अगोचरा तेरा अंतु न पाइआ ॥
अंतो न पाइआ किनै तेरा आपणा आपु तू जाणहे ॥
जीअ जंत सभि खेलु तेरा किआ को आखि वखाणए ॥
आखहि त वेखहि सभु तूहै जिनि जगतु उपाइआ ॥
कहै नानकु तू सदा अगमु है तेरा अंतु न पाइआ ॥१२॥



सुरि नर मुनि जन अम्रितु खोजदे सु अम्रितु गुर ते पाइआ ॥
पाइआ अम्रितु गुरि क्रिपा कीनी सचा मनि वसाइआ ॥
जीअ जंत सभि तुधु उपाए इकि वेखि परसणि आइआ ॥
लबु लोभु अहंकारु चूका सतिगुरू भला भाइआ ॥
कहै नानकु जिस नो आपि तुठा तिनि अम्रितु गुर ते पाइआ ॥१३॥



भगता की चाल निराली ॥
चाला निराली भगताह केरी बिखम मारगि चलणा ॥
लबु लोभु अहंकारु तजि त्रिसना बहुतु नाही बोलणा ॥
खंनिअहु तिखी वालहु निकी एतु मारगि जाणा ॥
गुर परसादी जिनी आपु तजिआ हरि वासना समाणी ॥
कहै नानकु चाल भगता जुगहु जुगु निराली ॥१४॥



जिउ तू चलाइहि तिव चलह सुआमी होरु किआ जाणा गुण तेरे ॥
जिव तू चलाइहि तिवै चलह जिना मारगि पावहे ॥
करि किरपा जिन नामि लाइहि सि हरि हरि सदा धिआवहे ॥
जिस नो कथा सुणाइहि आपणी सि गुरदुआरै सुखु पावहे ॥
कहै नानकु सचे साहिब जिउ भावै तिवै चलावहे ॥१५॥



एहु सोहिला सबदु सुहावा ॥
सबदो सुहावा सदा सोहिला सतिगुरू सुणाइआ ॥
एहु तिन कै मंनि वसिआ जिन धुरहु लिखिआ आइआ ॥
इकि फिरहि घनेरे करहि गला गली किनै न पाइआ ॥
कहै नानकु सबदु सोहिला सतिगुरू सुणाइआ ॥१६॥



पवितु होए से जना जिनी हरि धिआइआ ॥
हरि धिआइआ पवितु होए गुरमुखि जिनी धिआइआ ॥
पवितु माता पिता कुट्मब सहित सिउ पवितु संगति सबाईआ ॥
कहदे पवितु सुणदे पवितु से पवितु जिनी मंनि वसाइआ ॥
कहै नानकु से पवितु जिनी गुरमुखि हरि हरि धिआइआ ॥१७॥



करमी सहजु न ऊपजै विणु सहजै सहसा न जाइ ॥
नह जाइ सहसा कितै संजमि रहे करम कमाए ॥
सहसै जीउ मलीणु है कितु संजमि धोता जाए ॥
मंनु धोवहु सबदि लागहु हरि सिउ रहहु चितु लाइ ॥
कहै नानकु गुर परसादी सहजु उपजै इहु सहसा इव जाइ ॥१८॥



जीअहु मैले बाहरहु निरमल ॥
बाहरहु निरमल जीअहु त मैले तिनी जनमु जूऐ हारिआ ॥
एह तिसना वडा रोगु लगा मरणु मनहु विसारिआ ॥
वेदा महि नामु उतमु सो सुणहि नाही फिरहि जिउ बेतालिआ ॥
कहै नानकु जिन सचु तजिआ कूड़े लागे तिनी जनमु जूऐ हारिआ ॥१९॥



जीअहु निरमल बाहरहु निरमल ॥
बाहरहु त निरमल जीअहु निरमल सतिगुर ते करणी कमाणी ॥
कूड़ की सोइ पहुचै नाही मनसा सचि समाणी ॥
जनमु रतनु जिनी खटिआ भले से वणजारे ॥
कहै नानकु जिन मंनु निरमलु सदा रहहि गुर नाले ॥२०॥



जे को सिखु गुरू सेती सनमुखु होवै ॥
होवै त सनमुखु सिखु कोई जीअहु रहै गुर नाले ॥
गुर के चरन हिरदै धिआए अंतर आतमै समाले ॥
आपु छडि सदा रहै परणै गुर बिनु अवरु न जाणै कोए ॥
कहै नानकु सुणहु संतहु सो सिखु सनमुखु होए ॥२१॥



जे को गुर ते वेमुखु होवै बिनु सतिगुर मुकति न पावै ॥
पावै मुकति न होर थै कोई पुछहु बिबेकीआ जाए ॥
अनेक जूनी भरमि आवै विणु सतिगुर मुकति न पाए ॥
फिरि मुकति पाए लागि चरणी सतिगुरू सबदु सुणाए ॥
कहै नानकु वीचारि देखहु विणु सतिगुर मुकति न पाए ॥२२॥



आवहु सिख सतिगुरू के पिआरिहो गावहु सची बाणी ॥
बाणी त गावहु गुरू केरी बाणीआ सिरि बाणी ॥
जिन कउ नदरि करमु होवै हिरदै तिना समाणी ॥
पीवहु अम्रितु सदा रहहु हरि रंगि जपिहु सारिगपाणी ॥
कहै नानकु सदा गावहु एह सची बाणी ॥२३॥



सतिगुरू बिना होर कची है बाणी ॥
बाणी त कची सतिगुरू बाझहु होर कची बाणी ॥
आखि वखाणी ॥कहदे कचे सुणदे कचे कची
हरि हरि नित करहि रसना कहिआ कछू न जाणी ॥
चितु जिन का हिरि लइआ माइआ बोलनि पए रवाणी ॥
कहै नानकु सतिगुरू बाझहु होर कची बाणी ॥२४॥



गुर का सबदु रतंनु है हीरे जितु जड़ाउ ॥
सबदु रतनु जितु मंनु लागा एहु होआ समाउ ॥
सबद सेती मनु मिलिआ सचै लाइआ भाउ ॥
आपे हीरा रतनु आपे जिस नो देइ बुझाइ ॥
कहै नानकु सबदु रतनु है हीरा जितु जड़ाउ ॥२५॥



सिव सकति आपि उपाइ कै करता आपे हुकमु वरताए ॥
हुकमु वरताए आपि वेखै गुरमुखि किसै बुझाए ॥
तोड़े बंधन होवै मुकतु सबदु मंनि वसाए ॥
गुरमुखि जिस नो आपि करे सु होवै एकस सिउ लिव लाए ॥
कहै नानकु आपि करता आपे हुकमु बुझाए ॥२६॥



सिम्रिति सासत्र पुंन पाप बीचारदे ततै सार न जाणी ॥
ततै सार न जाणी गुरू बाझहु ततै सार न जाणी ॥
तिही गुणी संसारु भ्रमि सुता सुतिआ रैणि विहाणी ॥
गुर किरपा ते से जन जागे जिना हरि मनि वसिआ बोलहि अम्रित बाणी ॥
कहै नानकु सो ततु पाए जिस नो अनदिनु हरि लिव लागै जागत रैणि विहाणी ॥२७॥



माता के उदर महि प्रतिपाल करे सो किउ मनहु विसारीऐ ॥
मनहु किउ विसारीऐ एवडु दाता जि अगनि महि आहारु पहुचावए ॥
ओस नो किहु पोहि न सकी जिस नउ आपणी लिव लावए ॥
आपणी लिव आपे लाए गुरमुखि सदा समालीऐ ॥
कहै नानकु एवडु दाता सो किउ मनहु विसारीऐ ॥२८॥



जैसी अगनि उदर महि तैसी बाहरि माइआ ॥
माइआ अगनि सभ इको जेही करतै खेलु रचाइआ ॥
जा तिसु भाणा ता जमिआ परवारि भला भाइआ ॥
लिव छुड़की लगी त्रिसना माइआ अमरु वरताइआ ॥
एह माइआ जितु हरि विसरै मोहु उपजै भाउ दूजा लाइआ ॥
कहै नानकु गुर परसादी जिना लिव लागी तिनी विचे माइआ पाइआ ॥२९॥



हरि आपि अमुलकु है मुलि न पाइआ जाइ ॥
मुलि न पाइआ जाइ किसै विटहु रहे लोक विललाइ ॥
ऐसा सतिगुरु जे मिलै तिस नो सिरु सउपीऐ विचहु आपु जाइ ॥
जिस दा जीउ तिसु मिलि रहै हरि वसै मनि आइ ॥
हरि आपि अमुलकु है भाग तिना के नानका जिन हरि पलै पाइ ॥३०॥



हरि रासि मेरी मनु वणजारा ॥
हरि रासि मेरी मनु वणजारा सतिगुर ते रासि जाणी ॥
हरि हरि नित जपिहु जीअहु लाहा खटिहु दिहाड़ी ॥
एहु धनु तिना मिलिआ जिन हरि आपे भाणा ॥
कहै नानकु हरि रासि मेरी मनु होआ वणजारा ॥३१॥



ए रसना तू अन रसि राचि रही तेरी पिआस न जाइ ॥
पिआस न जाइ होरतु कितै जिचरु हरि रसु पलै न पाइ ॥
हरि रसु पाइ पलै पीऐ हरि रसु बहुड़ि न त्रिसना लागै आइ ॥
एहु हरि रसु करमी पाईऐ सतिगुरु मिलै जिसु आइ ॥
कहै नानकु होरि अन रस सभि वीसरे जा हरि वसै मनि आइ ॥३२॥


ए सरीरा मेरिआ हरि तुम महि जोति रखी ता तू जग महि आइआ ॥
हरि जोति रखी तुधु विचि ता तू जग महि आइआ ॥
हरि आपे माता आपे पिता जिनि जीउ उपाइ जगतु दिखाइआ ॥
गुर परसादी बुझिआ ता चलतु होआ चलतु नदरी आइआ ॥
कहै नानकु स्रिसटि का मूलु रचिआ जोति राखी ता तू जग महि आइआ ॥३३॥


मनि चाउ भइआ प्रभ आगमु सुणिआ ॥
हरि मंगलु गाउ सखी ग्रिहु मंदरु बणिआ ॥
हरि गाउ मंगलु नित सखीए सोगु दूखु न विआपए ॥
गुर चरन लागे दिन सभागे आपणा पिरु जापए ॥
अनहत बाणी गुर सबदि जाणी हरि नामु हरि रसु भोगो ॥
कहै नानकु प्रभु आपि मिलिआ करण कारण जोगो ॥३४॥



ए सरीरा मेरिआ इसु जग महि आइ कै किआ तुधु करम कमाइआ ॥
कि करम कमाइआ तुधु सरीरा जा तू जग महि आइआ ॥
जिनि हरि तेरा रचनु रचिआ सो हरि मनि न वसाइआ ॥
गुर परसादी हरि मंनि वसिआ पूरबि लिखिआ पाइआ ॥
कहै नानकु एहु सरीरु परवाणु होआ जिनि सतिगुर सिउ चितु लाइआ ॥३५॥



ए नेत्रहु मेरिहो हरि तुम महि जोति धरी हरि बिनु अवरु न देखहु कोई ॥
हरि बिनु अवरु न देखहु कोई नदरी हरि निहालिआ ॥
एहु विसु संसारु तुम देखदे एहु हरि का रूपु है हरि रूपु नदरी आइआ ॥
गुर परसादी बुझिआ जा वेखा हरि इकु है हरि बिनु अवरु न कोई ॥
कहै नानकु एहि नेत्र अंध से सतिगुरि मिलिऐ दिब द्रिसटि होई ॥३६॥


ए स्रवणहु मेरिहो साचै सुनणै नो पठाए ॥
साचै सुनणै नो पठाए सरीरि लाए सुणहु सति बाणी ॥
जितु सुणी मनु तनु हरिआ होआ रसना रसि समाणी ॥
सचु अलख विडाणी ता की गति कही न जाए ॥
कहै नानकु अम्रित नामु सुणहु पवित्र होवहु साचै सुनणै नो पठाए ॥३७॥


हरि जीउ गुफा अंदरि रखि कै वाजा पवणु वजाइआ ॥
वजाइआ वाजा पउण नउ दुआरे परगटु कीए दसवा गुपतु रखाइआ ॥
गुरदुआरै लाइ भावनी इकना दसवा दुआरु दिखाइआ ॥
तह अनेक रूप नाउ नव निधि तिस दा अंतु न जाई पाइआ ॥
कहै नानकु हरि पिआरै जीउ गुफा अंदरि रखि कै वाजा पवणु वजाइआ ॥३८॥



एहु साचा सोहिला साचै घरि गावहु ॥
गावहु त सोहिला घरि साचै जिथै सदा सचु धिआवहे ॥
सचो धिआवहि जा तुधु भावहि गुरमुखि जिना बुझावहे ॥
इहु सचु सभना का खसमु है जिसु बखसे सो जनु पावहे ॥
कहै नानकु सचु सोहिला सचै घरि गावहे ॥३९॥



अनदु सुणहु वडभागीहो सगल मनोरथ पूरे ॥
पारब्रहमु प्रभु पाइआ उतरे सगल विसूरे ॥
दूख रोग संताप उतरे सुणी सची बाणी ॥
संत साजन भए सरसे पूरे गुर ते जाणी ॥
सुणते पुनीत कहते पवितु सतिगुरु रहिआ भरपूरे ॥
बिनवंति नानकु गुर चरण लागे वाजे अनहद तूरे ॥४०॥१॥
   `
})


// CHOPAI SAHIB
chopaisahib.addEventListener("click", function(){
    rehrassahib.style.backgroundColor = "white"
    rehrassahib.style.color = "black"
    anandsahib.style.backgroundColor = "white"
    anandsahib.style.color = "black"
    japjisahib.style.backgroundColor = "white"
    japjisahib.style.color = "black"
    chopaisahib.style.backgroundColor = "black"
   chopaisahib.style.padding = "5px"
   chopaisahib.style.color = "white"
   path.innerHTML = `
   ੴ स्री वाहगुरू जी की फतह ॥
   पातिसाही १० ॥
   कबियो बाच बेनती ॥
   चौपई ॥
   
   हमरी करो हाथ दै रछा ॥
   पूरन होइ चि्त की इछा ॥
   तव चरनन मन रहै हमारा ॥
   अपना जान करो प्रतिपारा ॥१॥
   
   हमरे दुशट सभै तुम घावहु ॥
   आपु हाथ दै मोहि बचावहु ॥
   सुखी बसै मोरो परिवारा ॥
   सेवक सि्खय सभै करतारा ॥२॥
   
   मो रछा निजु कर दै करियै ॥
   सभ बैरिन कौ आज संघरियै ॥
   पूरन होइ हमारी आसा ॥
   तोरि भजन की रहै पियासा ॥३॥
   
   तुमहि छाडि कोई अवर न धयाऊं ॥
   जो बर चहों सु तुमते पाऊं ॥
   सेवक सि्खय हमारे तारियहि ॥
   चुन चुन श्त्रु हमारे मारियहि ॥४॥
   
   आपु हाथ दै मुझै उबरियै ॥
   मरन काल का त्रास निवरियै ॥
   हूजो सदा हमारे प्छा ॥
   स्री असिधुज जू करियहु ्रछा ॥५॥
   
   राखि लेहु मुहि राखनहारे ॥
   साहिब संत सहाइ पियारे ॥
   दीनबंधु दुशटन के हंता ॥
   तुमहो पुरी चतुरदस कंता ॥६॥
   
   काल पाइ ब्रहमा बपु धरा ॥
   काल पाइ शिवजू अवतरा ॥
   काल पाइ करि बिशन प्रकाशा ॥
   सकल काल का कीया तमाशा ॥७॥
   
   जवन काल जोगी शिव कीयो ॥
   बेद राज ब्रहमा जू थीयो ॥
   जवन काल सभ लोक सवारा ॥
   नमशकार है ताहि हमारा ॥८॥
   
   जवन काल सभ जगत बनायो ॥
   देव दैत ज्छन उपजायो ॥
   आदि अंति एकै अवतारा ॥
   सोई गुरू समझियहु हमारा ॥९॥
   
   नमशकार तिस ही को हमारी ॥
   सकल प्रजा जिन आप सवारी ॥
   सिवकन को सवगुन सुख दीयो ॥
   श्त्रुन को पल मो बध कीयो ॥१०॥
   
   घट घट के अंतर की जानत ॥
   भले बुरे की पीर पछानत ॥
   चीटी ते कुंचर असथूला ॥
   सभ पर क्रिपा द्रिशटि करि फूला ॥११॥
   
   संतन दुख पाए ते दुखी ॥
   सुख पाए साधन के सुखी ॥
   एक एक की पीर पछानै ॥
   घट घट के पट पट की जानै ॥१२॥
   
   जब उदकरख करा करतारा ॥
   प्रजा धरत तब देह अपारा ॥
   जब आकरख करत हो कबहूं ॥
   तुम मै मिलत देह धर सभहूं ॥१३॥
   
   जेते बदन स्रिशटि सभ धारै ॥
   आपु आपुनी बूझि उचारै ॥
   तुम सभ ही ते रहत निरालम ॥
   जानत बेद भेद अरु आलम ॥१४॥
   
   निरंकार न्रिबिकार न्रिल्मभ ॥
   आदि अनील अनादि अस्मभ ॥
   ताका मूड़्ह उचारत भेदा ॥
   जाको भेव न पावत बेदा ॥१५॥
   
   ताकौ करि पाहन अनुमानत ॥
   महां मूड़्ह कछु भेद न जानत ॥
   महांदेव कौ कहत सदा शिव ॥
   निरंकार का चीनत नहि भिव ॥१६॥
   
   आपु आपुनी बुधि है जेती ॥
   बरनत भिंन भिंन तुहि तेती ॥
   तुमरा लखा न जाइ पसारा ॥
   किह बिधि सजा प्रथम संसारा ॥१७॥
   
   एकै रूप अनूप सरूपा ॥
   रंक भयो राव कहीं भूपा ॥
   अंडज जेरज सेतज कीनी ॥
   उतभुज खानि बहुरि रचि दीनी ॥१८॥
   
   कहूं फूलि राजा ह्वै बैठा ॥
   कहूं सिमटि भयो शंकर इकैठा ॥
   सगरी स्रिशटि दिखाइ अच्मभव ॥
   आदि जुगादि सरूप सुय्मभव ॥१९॥
   
   अब ्रछा मेरी तुम करो ॥
   सि्खय उबारि असि्खय स्घरो ॥
   दुशट जिते उठवत उतपाता ॥
   सकल मलेछ करो रण घाता ॥२०॥
   
   जे असिधुज तव शरनी परे ॥
   तिन के दुशट दुखित ह्वै मरे ॥
   पुरख जवन पगु परे तिहारे ॥
   तिन के तुम संकट सभ टारे ॥२१॥
   
   जो कलि कौ इक बार धिऐहै ॥
   ता के काल निकटि नहि ऐहै ॥
   ्रछा होइ ताहि सभ काला ॥
   दुशट अरिशट टरे ततकाला ॥२२॥
   
   क्रिपा द्रिशाटि तन जाहि निहरिहो ॥
   ताके ताप तनक महि हरिहो ॥
   रि्धि सि्धि घर मों सभ होई ॥
   दुशट छाह छ्वै सकै न कोई ॥२३॥
   
   एक बार जिन तुमैं स्मभारा ॥
   काल फास ते ताहि उबारा ॥
   जिन नर नाम तिहारो कहा ॥
   दारिद दुशट दोख ते रहा ॥२४॥
   
   खड़ग केत मैं शरनि तिहारी ॥
   आप हाथ दै लेहु उबारी ॥
   सरब ठौर मो होहु सहाई ॥
   दुशट दोख ते लेहु बचाई ॥२५॥
   `
})